{
    "tagName": "CounterWithTransition",
    "customTagType": "JS",
    "scenarioFile": "tags/count/count.js",
    "functionName": "counterWithTransition",
    "caption": {
        "ru": "Счетчик попаданий в шаг",
        "eng": "State trigger counter"
    },
    "description": {
        "ru": "При попадании в шаг с этим блоком увеличивается внутренний счетчик. Если он превысит заданный лимит, бот перейдет в другой шаг.",
        "eng": "Triggering a state with this block increments an internal counter. If it exceeds the specified limit, the bot will switch to another state."
    },
    "hint": {
        "ru": "Увеличить счетчик попаданий и перейти в другой шаг, если лимит превышен",
        "eng": "Increment a counter and switch to another state if the limit is exceeded"
    },
    "parameters": [
        {
            "name": "inRow",
            "type": "bool",
            "required": true,
            "localization": {
                "ru": "Подряд",
                "eng": "In row"
            },
            "description": {
                "ru": "Если этот параметр активен, счетчик будет учитывать только попадания подряд.",
                "eng": "If this parameter is enabled, only consecutive triggers will be counted."
            }
        },
        {
            "name": "limit",
            "type": "integer",
            "required": true,
            "localization": {
                "ru": "Лимит",
                "eng": "Limit"
            },
            "description": {
                "ru": "Если значение счетчика превысит лимит, бот перейдет в целевой шаг.",
                "eng": "If the counter value exceeds this limit, the bot will switch to the target state."
            }
        },
        {
            "name": "key",
            "type": "string",
            "required": true,
            "localization": {
                "ru": "Идентификатор",
                "eng": "ID"
            },
            "description": {
                "ru": "Для подсчета разных показателей вы можете использовать в сценарии несколько счетчиков. Идентификатор определяет, какой именно счетчик будет увеличен.",
                "eng": "Your script can have many counters for different metrics. The ID determines which of these counters will be incremented."
            }
        },
        {
            "name": "targetState",
            "type": "state",
            "required": true,
            "localization": {
                "ru": "Целевой шаг",
                "eng": "Target state"
            },
            "description": {
                "ru": "Бот перейдет в этот шаг, если счетчик превысит лимит.",
                "eng": "The bot will switch to this state if the counter exceeds the limit."
            }
        }
    ]
}
